{
  "API Policy": {
    "ignore this test": [],
    "Core Policies": [
      "Projects cannot violate any laws.",
      "Do not create or develop projects that infringe on the Hypixel trademark and branding.",
      "Your product must be clear that it is not affiliated or endorsed by Hypixel.",
      {
        "Our API is designed to be used by players, and not for automated data collection at scale.": [
          "For example, you may not use the API for continuous polling of player data for detection of stats earned in-game to offer a history to players using your website. This includes applications that offer a temporary tracking of their stats based on user input, sometimes known as session tracking.",
          {
            "We do make an exception for those applications that wish to update only a few players with a specific purpose, such as role syncing for a small set of users, or activity tracking for a guild.": [
              "We still ask that people doing this do so at a respectful interval, and not request data more often than absolutely needed.",
              "We will not grant increased limits or production applications for this purpose.",
              "Applications that are created for the intention of tracking player statistics for progress tracking are not allowed."
            ]
          },
          "We provide some endpoints that do not require an API key, these exist to allow more continuous polling of that data and we will not provide an increased API limit for requests that wish to bypass this for faster updates of their data.",
          {
            "We also make an exception for some endpoints that are created for continuous polling, we however still expect developers to request them at respectful intervals. These endpoints are:": [
              "/v2/boosters",
              "/v2/counts",
              "/v2/leaderboards",
              "/v2/punishmentstats",
              "/v2/skyblock/news",
              "/v2/housing/active"
            ]
          }
        ]
      },
      "You may not create an application for the purpose of proxying the Public API to 3rd party developers."
    ],
    "Registration": [
      "All projects that make use of authenticated API endpoints must be registered in our Hypixel Developer Portal.",
      {
        "Each project should be registered as its own application, you may not use one application across multiple projects.": [
          "This applies to top level projects and not individual parts of an overall offering. As an example, if you have a website that provides stats, but also a Discord bot that uses the same backend as the website, they both may use the same application as they both fall under the same service."
        ]
      },
      "Personal and Production applications should not be used solely for developement use. Owners of Production applications are automatically granted longer expiration developer keys compared to the default 3 days.",
      "You may not make use of multiple applications/keys to bypass API limits, this includes using developer keys to aid production keys in bypassing limits."
    ],
    "Monetization": [
      "Your project cannot feature any instances of betting or gambling functionality.",
      {
        "You may monetize your project as long as it is registered on the Hypixel Developer Dashboard as a production application.": [
          "You must provide a free tier of access for all users, this tier may include advertising.",
          {
            "Any content provided from the API must be transformative if it is behind any sort of access or paywall.": [
              "If value has been added by creating new information, new aesthetics, new insights, and understandings, then it is considered transformative."
            ]
          },
          {
            "Acceptable ways to monetize your project include:": [
              "Advertisements",
              "Donations, subscriptions, or crowdfunding"
            ]
          },
          "You may not use currencies that cannot be exchanged back into fiat.",
          "Your choice of monetization cannot gouge players or be considered unfair.",
          "If you are unsure if your monetization is acceptable, please contact us via ourSupport platform"
        ]
      }
    ],
    "Game Integrity": [
      "Your project must not be utilized in any manner that could compromise the integrity of our games.",
      "Projects should not create an unfair advantage for players and must not encourage the breaking of our rules.",
      "Projects should not de-anonymize players such as those who are using the Hypixel nick feature.",
      "Projects should not be created for the sole purpose of tracking specific players, for example, players with specific ranks or stats."
    ],
    "Using the API": [
      {
        "Projects should utilize caching to the best of their abilities to reduce requests on the API. Some endpoints may also rate-limit users if they request the same data within a short period of time.": [
          "For example, if you have a mod that requests the level of players in a lobby, you should implement caching that expires either hours, or even days later. This allows further users who see the same player to use the cache, and not request the API."
        ]
      },
      {
        "Do not share your API key with 3rd parties, such as entering them into a website or a mod": [
          "This applies to any publicly available mod, regardless of it being allowed on the Hypixel Server.",
          "As part of this, we also recommend not using your API key in publicly hosted services, such as online spreadsheet services, due to their nature of shared IP addresses."
        ]
      },
      "Do not include your API key in your code, especially if you plan to distribute a binary or have the code available publicly"
    ],
    "Inactive Applications": [
      "To ensure security and stability of the API, inactive applications may be disabled or deleted.",
      {
        "We currently consider an API application inactive if any of the following conditions are met:": [
          "The API application has made zero total requests after 14 days from creation.",
          "The API application has made zero requests over the last 28 day period."
        ]
      }
    ]
  },
  "lastUpdated": {
    "string": "April 3, 2025",
    "unix": 1743652800
  }
}
